examples/openfoam_org/channel/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
|                                                                             |
|                Generated by the CfdOF workbench for FreeCAD                 |
|                      https://github.com/jaheyns/CfdOF                       |
|                                                                             |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases
(
Water
Air
);

Water
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 1.0050100200400802e-06;
    rho             [1 -3 0 0 0 0 0] 998.0;
}

Air
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 1.5e-05;
    rho             [1 -3 0 0 0 0 0] 1.2;
}

sigma           [1 0 -2 0 0 0 0] 0.07;

// ************************************************************************* //
