examples/openfoam_org/channel/system/FOs/FOwriteCellAreas
writeCellAreas1
{
	type coded;
	libs ("libutilityFunctionObjects.so");
	name writeCellAreas;

	enabled true;
	log true;
	timeStart 0;
	timeEnd 0;
	executeControl writeTime;
	executeInterval -1;
	writeControl writeTime;
	writeInterval -1;

	codeInclude
	#{
		#include "volFields.H"
		#include "surfaceFields.H"
	#};

	codeExecute
	#{
		Info << "Execute writeFaceAreas" << endl;
		surfaceScalarField faceAreas
		(
			IOobject
			(
				"area",
				mesh().time().name(),
				mesh(),
				IOobject::NO_READ,
				IOobject::AUTO_WRITE
			),
			mesh().magSf()
		);

		Info << "	Writing cell face areas [area] to 0" << endl;
		faceAreas.write();
	#};
}
