examples/openfoam_org/channel/system/FOs/FOwriteCellCentres
writeCellCentres1
{
	type writeCellCentres;
	libs ("libutilityFunctionObjects.so");

	enabled true;
	log true;
	timeStart 0;
	timeEnd 0;
	executeControl writeTime;
	executeInterval -1;
	writeControl writeTime;
	writeInterval -1;
}
