examples/openfoam_org/channel/Allrun
#!/bin/bash

cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application name
application=$(getApplication)

runApplication decomposePar

runParallel $application

runApplication reconstructPar

#------------------------------------------------------------------------------
